Repository: fsarta/glufri
Catalog: lib/core/l10n/intl_*.arb
Languages: it

source: Add
it: Aggiungi

source: Cancel
it: Annulla

source: Close
it: Chiudi

# continueAction
source: CONTINUE
it: CONTINUA

source: Create
it: Crea

source: Delete
it: Elimina

source: Duplicate
it: Duplica

source: Edit
it: Modifica

source: Loading...
it: Caricamento...

source: or
it: oppure

source: Price
it: Prezzo

source: Product Name
it: Nome Prodotto

source: Quantity
it: Quantità

source: Save
it: Salva

source: Skip
it: Salta

source: Start
it: Inizia

source: Store
it: Negozio

source: Total
it: Totale

# undoAction
source: UNDO
it: ANNULLA

source: Update
it: Aggiorna

source: Favorite Products
it: Prodotti Preferiti

# forgotPasswordScreenTitle
source: Recover Password
it: Recupera Password

source: Monthly Budget
it: Budget Mensile

source: Purchase History
it: Cronologia Acquisti

# scanBarcodeTitle
source: Scan EAN-13
it: Scansiona EAN-13

source: Settings
it: Impostazioni

source: Shopping Lists
it: Liste della Spesa

# shoppingListsScreenTitle
source: Shopping Lists
it: Liste della Spesa

# onboardingScanBody
source: Use the camera to scan product barcodes and add them to your cart.
it: Usa la fotocamera per scansionare il codice a barre dei prodotti e aggiungerli al tuo carrello.

# onboardingScanTitle
source: Scan and Add
it: Scansiona e Aggiungi

# onboardingTrackBody
source: Save your purchases and view the history to analyze your spending.
it: Salva i tuoi acquisti e consulta la cronologia per analizzare le tue spese.

# onboardingTrackTitle
source: Keep Everything Under Control
it: Tieni Tutto Sotto Controllo

# onboardingWelcomeBody
source: Your app to track gluten-free purchases quickly and easily.
it: La tua app per tracciare gli acquisti senza glutine in modo semplice e veloce.

# onboardingWelcomeTitle
source: Welcome to Glufri!
it: Benvenuto in Glufri!

# alreadyHaveAccount
source: Already have an account? Login
it: Hai già un account? Accedi

# alreadyHaveAccountPrompt
source: Already have an account?
it: Hai già un account?

source: Back to Login
it: Torna al Login

source: Confirm Password
it: Conferma Password

source: Forgot password?
it: Password dimenticata?

# forgotPasswordInstruction
source: Enter the email associated with your account. We'll send you a link to reset your password.
it: Inserisci l'email associata al tuo account. Ti invieremo un link per reimpostare la tua password.

# forgotPasswordSubtitle
source: No problem! Enter your email and we'll help you out.
it: Nessun problema! Inserisci la tua email e ti aiuteremo.

# forgotPasswordTitle
source: Forgot Password?
it: Password Dimenticata?

# googleLoginFailed
source: Google login failed. Please try again.
it: Login con Google fallito. Riprova.

# invalidEmailError
source: Please enter a valid email.
it: Inserisci un'email valida.

# loggedInAs
source: Logged in as {email}
it: Loggato come {email}

source: Login
it: Accedi

# loginAction
source: LOGIN
it: ACCEDI

# loginError
source: Invalid email or password. Please try again.
it: Email o password errati. Riprova.

# loginToSaveData
source: Log in to save your data
it: Accedi per salvare i tuoi dati

# loginSubtitle
source: Login to your account to continue.
it: Accedi al tuo account per continuare.

# loginSuccess
source: Welcome!
it: Benvenuto/a!

# loginWelcome
source: Welcome Back!
it: Bentornato!

source: Login with Google
it: Accedi con Google

# logoutSuccess
source: Logged out successfully.
it: Logout effettuato con successo.

# noAccount
source: Don't have an account? Sign up
it: Non hai un account? Registrati

# noAccountPrompt
source: Don't have an account?
it: Non hai un account?

# passwordLengthError
source: The password must be at least 6 characters long.
it: La password deve essere di almeno 6 caratteri.

# passwordsDoNotMatchError
source: Passwords do not match.
it: Le password non coincidono.

# resetEmailError
source: Error sending the email. The address may not be valid.
it: Errore durante l'invio dell'email. L'indirizzo potrebbe non essere valido.

# resetEmailSuccess
source: Recovery email sent successfully! Check your inbox.
it: Email di recupero inviata con successo! Controlla la tua casella di posta.

source: SEND RESET EMAIL
it: INVIA EMAIL DI RECUPERO

source: Sign up
it: Registrati

# signupAction
source: SIGN UP
it: REGISTRATI

# signupError
source: Error during signup. Please try again. (e.g., the email might already be in use)
it: Errore durante la registrazione. Riprova. (es. l'email potrebbe essere già in uso)

# signupSubtitle
source: Create an account to save your data
it: Crea un account per salvare i tuoi dati

# signupTitle
source: Create your account
it: Crea il tuo account

source: User
it: Utente

# userGuest
source: Guest User
it: Utente Ospite

source: Add Item
it: Aggiungi Prodotto

# addProductToStart
source: Add a product to get started.
it: Aggiungi un prodotto per iniziare.

# andMoreProducts
source: ... and {count} more products.
it: ... e altri {count} prodotti.

# atStore
source: at
it: presso

source: Barcode (Optional)
it: Codice a Barre (Opzionale)

source: Edit Product
it: Modifica Prodotto

source: Edit Purchase
it: Modifica Acquisto

source: Export CSV (Pro)
it: Esporta CSV (Pro)

# exportPdfAnnualReport
source: Export Annual Report
it: Esporta Report Annuale

# exportPdfCompleteReport
source: Complete Report
it: Report Completo

# exportPdfMonthlyReport
source: Export Monthly Report
it: Esporta Report Mensile

# exportPdfReportTooltip
source: Export Report
it: Esporta Report

# filterByDateTooltip
source: Filter by date
it: Filtra per data

source: Found products:
it: Prodotti trovati:

source: Generic purchase
it: Acquisto generico

source: Gluten-Free
it: Senza Glutine

source: Gluten-Free Product
it: Prodotto Senza Glutine

source: Last price:
it: Ultimo prezzo:

source: Main products:
it: Prodotti principali:

# mustBeGreaterThanZero
source: Must be > 0
it: Deve essere > 0

source: New Purchase
it: Nuovo Acquisto

# noProductsFoundFor
source: No products found for "{query}"
it: Nessun prodotto trovato per "{query}"

# noPurchases
source: No purchases recorded. Press "+" to get started!
it: Nessun acquisto registrato. Premi "+" per iniziare!

source: No store specified
it: Nessun negozio specificato

source: Other
it: Altro

# pdfReportTitleAnnual
source: Spending Report - {year}
it: Report Spese - {year}

# pdfReportTitleComplete
source: Complete Spending Report
it: Report Spese Completo

# pdfReportTitleMonthly
source: Spending Report - {date}
it: Report Spese - {date}

# priceRange
source: Prices: from €{min} to €{max}
it: Prezzi: da {min}€ a {max}€

# productHistoryTitle
source: Product already purchased!
it: Prodotto già acquistato!

# productNameCannotBeEmpty
source: Name cannot be empty
it: Il nome non può essere vuoto

source: Product not found or network error.
it: Prodotto non trovato o errore di rete.

# productsCount
source: {count,plural, =0{No products} =1{1 product} other{{count} products}}
it: {count,plural, =0{Nessun prodotto} =1{1 prodotto} other{{count} prodotti}}

source: Purchase Detail
it: Dettaglio Acquisto

# purchaseExport
source: Glufri Purchase Export - {store}
it: Esportazione Acquisto Glufri - {store}

# purchaseMarkedForDeletion
source: Purchase deleted.
it: Acquisto eliminato.

# purchaseSavedSuccess
source: Purchase saved successfully!
it: Acquisto salvato con successo!

# purchasedXTimes
source: {count,plural, =0{Never purchased} =1{Purchased 1 time} other{Purchased {count} times}}
it: {count,plural, =0{Mai acquistato} =1{Acquistato 1 volta} other{Acquistato {count} volte}}

# removeDateFilterTooltip
source: Remove date filter
it: Rimuovi filtro data

source: Save Purchase
it: Salva Acquisto

source: Scan Barcode
it: Scansiona Codice

# searchPlaceholder
source: Search by store or product...
it: Cerca per negozio o prodotto...

# selectMonthOfYear
source: Select a Month of {year}
it: Seleziona un Mese del {year}

source: Share Summary
it: Condividi Riepilogo

# shareText
source: Here's my latest gluten-free purchase tracked with the Glufri app! 🛒
it: Ecco il mio ultimo acquisto senza glutine tracciato con l'app Glufri! 🛒

# storeHint
source: e.g., Rossi Supermarket
it: Es. Supermercato Rossi

source: times
it: volte

# totalGlutenFree
source: Gluten-Free Total
it: Totale Senza Glutine

# totalOther
source: Other Total
it: Totale Altro

# totalOverall
source: Overall Total
it: Totale Complessivo

# trackedWith
source: Tracked with Glufri App
it: Tracciato con Glufri App

source: Add from Favorites
it: Aggiungi da Preferiti

# addItemToShoppingList
source: Add Item
it: Aggiungi Prodotto

# addItemTooltip
source: Add item
it: Aggiungi item

# addManual
source: Add manually
it: Aggiungi manualmente

# checkedItems
source: {checked}/{total} completed
it: {checked}/{total} completati

# createNewListTooltip
source: New List
it: Nuova Lista

# createListDialogTitle
source: Create New List
it: Crea Nuova Lista

# deleteListConfirmationBody
source: Are you sure you want to delete the list '{listName}'?
it: Sei sicuro di voler eliminare la lista '{listName}'?

# deleteListConfirmationTitle
source: Confirm Deletion
it: Conferma Eliminazione

# emptyShoppingList
source: No shopping lists found. Press '+' to create one.
it: Nessuna lista della spesa. Premi '+' per crearne una.

# itemAddedToList
source: '{itemName}' added to list.
it: '{itemName}' aggiunto alla lista.

source: List name
it: Nome della lista

# listNameEmptyError
source: Name cannot be empty.
it: Il nome non può essere vuoto.

# noItemsInShoppingList
source: Add or un-check at least one item to start.
it: Aggiungi o de-seleziona almeno un item per iniziare.

source: Start Purchase from List
it: Inizia Acquisto dalla Lista

# addEditFavoriteDialogAdd
source: Add Favorite
it: Aggiungi Preferito

# addEditFavoriteDialogEdit
source: Edit Favorite
it: Modifica Preferito

# addFavoriteProduct
source: Add Favorite
it: Aggiungi Preferito

# addFromFavoritesTooltip
source: Add from Favorites
it: Aggiungi da Preferiti

# addToFavorites
source: Add to favorite products
it: Aggiungi ai prodotti preferiti

# defaultPrice
source: Default Price (Optional)
it: Prezzo di Default (Opzionale)

# deleteFavoriteConfirmationBody
source: Are you sure you want to remove '{productName}' from your favorites?
it: Sei sicuro di voler eliminare '{productName}' dai preferiti?

# favoriteProductRemoved
source: '{productName}' removed from favorites.
it: '{productName}' rimosso dai preferiti.

# noFavoriteProducts
source: You don't have any favorite products yet. Save them from a purchase to find them here.
it: Non hai ancora prodotti preferiti. Salvali da un acquisto per trovarli qui.

# noFavoritesAvailable
source: You don't have any favorite products.
it: Non hai prodotti preferiti.

# selectFavorite
source: Select a Favorite
it: Seleziona un Preferito

# settingsFavProducts
source: Favorite Products
it: Prodotti Preferiti

source: Budget saved!
it: Budget salvato!

# budgetSetGlutenFree
source: Gluten-Free Budget
it: Budget Senza Glutine

# budgetSetTotal
source: Total Budget
it: Budget Totale

# budgetTitle
source: Budget for {monthYear}
it: Budget di {monthYear}

# budgetTrend
source: Spending Trend
it: Andamento Spesa

source: Remaining Budget
it: Residuo Budget

source: Save Budget
it: Salva Budget

# setBudget
source: Set Budgets
it: Imposta Budget

source: Dark
it: Scuro

source: Language
it: Lingua

source: Light
it: Chiaro

# privacyPolicyBody
source: Your privacy is important... [INSERT FULL PRIVACY POLICY TEXT HERE] Data Collected: The app saves purchase data exclusively on your device. If you choose to use the cloud backup feature (Pro feature), your data will be encrypted and saved on Google Firebase's secure servers. Data Sharing: No personal or purchase data is shared with third parties. ...
it: La tua privacy è importante... [INSERIRE QUI IL TESTO COMPLETO DELLA PRIVACY POLICY] Dati Raccolti: L'app salva i dati degli acquisti esclusivamente sul tuo dispositivo. Se scegli di utilizzare la funzione di backup cloud (funzionalità Pro), i tuoi dati verranno criptati e salvati sui server sicuri di Google Firebase. Condivisione Dati: Nessun dato personale o di acquisto viene condiviso con terze parti. ...

# privacyPolicyTitle
source: Privacy Policy
it: Informativa Privacy

# settingsAccountAndBackup
source: Account and Backup (Pro)
it: Account e Backup (Pro)

# settingsLanguageSystem
source: System
it: Sistema

# settingsLoginForBackup
source: Log in with Google to enable backup
it: Accedi con Google per abilitare il backup

# settingsLoginFailed
source: Login failed. Please try again.
it: Login fallito. Riprova.

# settingsPrivacyPolicy
source: Privacy Policy
it: Informativa Privacy

source: System
it: Sistema

source: Theme
it: Tema

# proRequiredForHistory
source: Go Pro to see price history!
it: Passa a Pro per vedere la cronologia prezzi!

# unlockPro
source: UNLOCK
it: SCOPRI

# upsellAction
source: Subscribe Now (Annual Price)
it: Abbonati Ora (Prezzo Annuo)

# upsellFeature1
source: Multi-device Backup and Sync
it: Backup e Sync Multi-dispositivo

# upsellFeature2
source: Unlimited CSV Exports
it: Esportazioni illimitate in CSV

# upsellFeature3
source: Ad-free experience
it: Esperienza senza pubblicità

# upsellFeature4
source: Priority Support
it: Supporto Prioritario

# upsellHeadline
source: Unlock Powerful Features!
it: Sblocca Funzionalità Potenti!

# upsellRestore
source: Restore Purchases
it: Ripristina Acquisti

# upsellTitle
source: Go Pro with Glufri
it: Passa a Glufri Pro

# backupError
source: Error during backup.
it: Errore durante il backup.

source: Backup in progress...
it: Backup in corso...

# backupSuccess
source: Backup completed successfully!
it: Backup completato con successo!

# migrationDeleted
source: Local data deleted successfully.
it: Dati locali eliminati con successo.

# migrationDialogActionDelete
source: DELETE
it: ELIMINA

# migrationDialogActionIgnore
source: NO, LEAVE THEM
it: NO, LASCIA

# migrationDialogActionMerge
source: YES, MERGE
it: SÌ, UNISCI

# migrationDialogBody
source: You have {count} purchases saved on this device. What do you want to do?
it: Hai {count} acquisti salvati su questo dispositivo. Cosa vuoi fare?

# migrationDialogTitle
source: Local Purchases Detected
it: Acquisti Locali Rilevati

# migrationSuccess
source: Local purchases merged with your account!
it: Acquisti locali uniti al tuo account!

# restoreConfirmationBody
source: This will overwrite all local data with the data saved in the cloud. Continue?
it: Questo sovrascriverà tutti i dati locali con quelli salvati nel cloud. Continuare?

# restoreConfirmationTitle
source: Restore Confirmation
it: Conferma Ripristino

# restoreError
source: Error during restore.
it: Errore durante il ripristino.

# restoreInProgress
source: Restoring in progress...
it: Ripristino in corso...

# restoreSuccess
source: Data restored successfully!
it: Dati ripristinati con successo!

# settingsAuthError
source: Authentication error
it: Errore di autenticazione

# settingsBackupNow
source: Back Up Now
it: Esegui Backup

# settingsRestoreFromCloud
source: Restore from Cloud
it: Ripristina da Cloud

# deleteConfirmationMessage
source: Are you sure you want to delete this purchase? This action is irreversible.
it: Sei sicuro di voler eliminare questo acquisto? L'azione è irreversibile.

# deleteConfirmationTitle
source: Delete Confirmation
it: Conferma Eliminazione

source: Export error.
it: Errore durante l'esportazione.

# genericError
source: An error occurred: {error}
it: Si è verificato un errore: {error}

source: Invalid value
it: Valore non valido

# listNotFound
source: List not found or deleted.
it: Lista non trovata o eliminata.

# pdfCreationError
source: Error creating the PDF.
it: Errore durante la creazione del PDF.

# purchaseDeletedSuccess
source: Purchase deleted successfully.
it: Acquisto eliminato con successo.

source: Required field
it: Campo obbligatorio

# shareError
source: Sharing error.
it: Errore durante la condivisione.

# shoppingListError
source: Error loading lists.
it: Errore nel caricamento delle liste.

# syncError
source: Synchronization error.
it: Errore di sincronizzazione.
